app/controllers/admin/articles_controller.rb

  def create
    @article = Article.new(article_params)
    @article.admin_id = current_admin.id
    if @article.save
---
INSERT INTO "articles" ("name", "image_id", "created_at", "updated_at", "admin_id", "prefecture_code", "address_city", "address_street", "address_building", "site_url", "tax", "opening_hours", "introduction") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @article = Article.find(params[:id])
    @article.admin_id = current_admin.id
    if @article.update(article_params)
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "articles" SET "name" = ?, "image_id" = ?, "prefecture_code" = ?, "address_city" = ?, "address_street" = ?, "site_url" = ?, "tax" = ?, "opening_hours" = ?, "introduction" = ?, "updated_at" = ? WHERE "articles"."id" = ?