app/views/public/comments/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
<% @article.comments.each do |comment| %>