app/views/admin/articles/show.html.erb

<div class="comments">
<p>コメント件数：<%= @article.comments.count %></p>
  <% @article.comments.each do |comment| %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]