app/views/admin/articles/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT AVG("comments"."rate") FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
      <script>
      $('#star-rate-<%= @article.id %>').raty({
        size: 36,
        starOff:  '<%= asset_path('star-off.png') %>',
        starOn : '<%= asset_path('star-on.png') %>',
        starHalf: '<%= asset_path('star-half.png') %>',
        half: true,
        readOnly: true,
        score: <%= @article.comments.average(:rate).to_f.round(1) %>,
      });

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."article_id" = ?  [["article_id", 3]]
SELECT COUNT(*) FROM "stamps" WHERE "stamps"."article_id" = ?  [["article_id", 3]]
---
    <tr>
      <td>いいね数<%= @article.favorites.count %></td>
      <td>スタンプ数<%= @article.stamps.count %></td>

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
  <div class="new-comment">
  <p>コメント件数：<%= @article.comments.count %></p>

SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 3]]
---
  <div class="comments">
<% @article.comments.each do |comment| %>