app/controllers/public/articles_controller.rb

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "articles" SET "user_id" = ?, "image_id" = ?, "address_city" = ?, "latitude" = ?, "longitude" = ?, "updated_at" = ? WHERE "articles"."id" = ?
---
  def update
    @article = Article.find(params[:id])
    @article.user_id = current_user.id
    if @article.update(article_params)

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @article = Article.find(params[:id])

SELECT "articles".* FROM "articles" WHERE (name like'%奈良%' OR introduction like'%奈良%' OR prefecture_code like'%奈良%' OR address_city like'%奈良%')
---
  def search
  @articles = Article.search(params[:keyword])