app/controllers/public/articles_controller.rb

  def show
    @article = Article.find(params[:id])
    @comment = Comment.new
    @comments = @article.comments.page(params[:page]).per(10)
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]

  def googlemap # 地図上にピンとそのリンク先を表示、県名を取得できるように
    @articles = Article.all
---
SELECT "articles".* FROM "articles"