app/controllers/public/comments_controller.rb

  def create
    article = Article.find(params[:article_id])
    comment = current_user.comments.new(comment_params)
    comment.article_id = article.id
    comment.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "user_id", "article_id", "title", "rate", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["body", ""], ["user_id", 1], ["article_id", 1], ["title", ""], ["rate", 3.5], ["created_at", "2021-06-12 05:07:23.818882"], ["updated_at", "2021-06-12 05:07:23.818882"]]

  def destroy
    Comment.find_by(id: params[:id], article_id: params[:article_id]).destroy
---
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? AND "comments"."article_id" = ? LIMIT ?  [["id", 1], ["article_id", 1], ["LIMIT", 1]]