app/controllers/public/stamps_controller.rb

  def create
    @article = Article.find(params[:article_id])
    stamp = current_user.stamps.new(article_id: @article.id)
    stamp.save
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "stamps" ("user_id", "article_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["article_id", 1], ["created_at", "2021-06-12 05:07:19.149467"], ["updated_at", "2021-06-12 05:07:19.149467"]]

  def destroy
    @article = Article.find(params[:article_id])
    stamp = current_user.stamps.find_by(article_id: @article.id)
    stamp.destroy
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "stamps".* FROM "stamps" WHERE "stamps"."user_id" = ? AND "stamps"."article_id" = ? LIMIT ?  [["user_id", 1], ["article_id", 2], ["LIMIT", 1]]
DELETE FROM "stamps" WHERE "stamps"."id" = ?  [["id", 2]]