app/views/public/articles/ranking.html.erb


      <p>コメント件数：<%= article.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]

    <% end %>
      <p>コメント件数：<%= article.comments.count %></p>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]