app/views/public/articles/show.html.erb

SELECT AVG("comments"."rate") FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 2]]
SELECT AVG("comments"."rate") FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---
      <script>
      $('#star-rate-<%= @article.id %>').raty({
        size: 36,
        starOff:  '<%= asset_path('star-off.png') %>',
        starOn : '<%= asset_path('star-on.png') %>',
        starHalf: '<%= asset_path('star-half.png') %>',
        half: true,
        readOnly: true,
        score: <%= @article.comments.average(:rate).to_f.round(1) %>,
      });

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 11]]
---

  <p>コメント件数：<%= @article.comments.count %></p>