app/views/public/articles/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
---

  <p>コメント件数：<%= @article.comments.count %></p>