app/views/public/users/favorites.html.erb

      <div id="star-rate-<%= article.id %>"></div>
      <p>コメント件数：<%= article.comments.count %></p>
        <script>
        $('#star-rate-<%= article.id %>').raty({
          size: 36,
          starOff:  '<%= asset_path('star-off.png') %>',
          starOn : '<%= asset_path('star-on.png') %>',
          starHalf: '<%= asset_path('star-half.png') %>',
          half: true,
          readOnly: true,
          score: <%= article.comments.average(:rate).to_f.round(1) %>,
        });
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]
SELECT AVG("comments"."rate") FROM "comments" WHERE "comments"."article_id" = ?  [["article_id", 1]]