app/views/public/users/show.html.erb

SELECT "articles".* FROM "articles"
---
        <h1><%= @user.name %></h1>
        <h2>温泉Lv.<%= @user.stamped_articles.count %></h2>